Функция СведенияОВнешнейОбработке() Экспорт
	ВидОтчета="ДополнительнаяОбработка";
	ИмяОтчета=ЭтотОбъект.Метаданные().Синоним;
	Версия=ЭтотОбъект.Метаданные().Комментарий;
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", ИмяОтчета);
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", Версия);
	РегистрационныеДанные.Вставить("ВерсияБСП", "1.0.0.0");

	РегистрационныеДанные.Вставить("Вид", ВидОтчета);
	
	РегистрационныеДанные.Вставить("Информация", "");
	
	ТЗКоманд = Новый ТаблицаЗначений;
	ТЗКоманд.Колонки.Добавить("Идентификатор");
	ТЗКоманд.Колонки.Добавить("Представление");
	ТЗКоманд.Колонки.Добавить("Модификатор");
	ТЗКоманд.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманд.Колонки.Добавить("Использование");
	
	СтрокаКоманды = ТЗКоманд.Добавить();
	СтрокаКоманды.Идентификатор = ВидОтчета+"."+ИмяОтчета;
	СтрокаКоманды.Представление = ИмяОтчета;
	СтрокаКоманды.ПоказыватьОповещение = Истина;
	СтрокаКоманды.Использование = "ОткрытиеФормы";
	
	РегистрационныеДанные.Вставить("Команды", ТЗКоманд);
	
	Возврат РегистрационныеДанные;
КонецФункции

