

Функция РаспределитьОстатками(Знач СуммаПП, КоллекцияОстатков)
	МассивСумм = Новый Массив;
	РаспрСумма = СуммаПП;
	Для каждого СтрокаОстатков Из КоллекцияОстатков Цикл
		ТекСуммаОстатка=СтрокаОстатков.Сумма;
		Если РаспрСумма > ТекСуммаОстатка Тогда
			МассивСумм.Добавить(ТекСуммаОстатка);  //полностью гашу задолженность
			ТекРаспрСумма=ТекСуммаОстатка;
		Иначе
			МассивСумм.Добавить(РаспрСумма);  //частично гашу задолженность или 0
			ТекРаспрСумма=РаспрСумма;			
		КонецЕсли;
		РаспрСумма = РаспрСумма - ТекРаспрСумма;
	КонецЦикла; 
	
	Возврат МассивСумм;	
КонецФункции



Процедура Инициализировать (Объект, ИмяТабличнойЧасти, ТабличноеПолеОбъекта) Экспорт
	 
	 Если Объект.СотрудникиОрганизации.Количество() > 0 Тогда
		ТекстВопроса = "Существующий список сотрудников будет очищен. Продолжить?";
		Если РаботаСДиалогами.ЗадатьВопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Сообщить(ТекущаяДата());
	Объект.СотрудникиОрганизации.Очистить();
	
	ФизическиеЛица = Неопределено;
	Если Объект.Сумма = 0 Тогда
		Возврат 
	КонецЕсли;
	
	ДатаОперации= ДобавитьМесяц(Объект.МесяцНалоговогоПериода,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.ФизЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Остатки(
	|			,
	|			Организация = &Организация
	|				И Ставка = &Ставка
	|				И ИсчисленоПоДивидендам = ЛОЖЬ) КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.ФизЛицо,
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ КАК РасчетыНалоговыхАгентовСБюджетомПоНДФЛ
	|ГДЕ
	|	РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Регистратор = &Регистратор
	|	И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Организация = &Организация
	|	И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Ставка = &Ставка
	|	И РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.МесяцНалоговогоПериода = &МесяцНалоговогоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Остатки.ФизЛицо,
	|	СУММА(Остатки.Сумма) КАК Сумма
	|ИЗ
	|	ВТОстатки КАК Остатки
	|
	|СГРУППИРОВАТЬ ПО
	|	Остатки.ФизЛицо
	|
	|ИМЕЮЩИЕ
	|	СУММА(Остатки.Сумма) > 0";
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	//Запрос.УстановитьПараметр("ДатаОперации", ДатаОперации );
	Запрос.УстановитьПараметр("МесяцНалоговогоПериода", Объект.МесяцНалоговогоПериода);
	Запрос.УстановитьПараметр("Ставка", Объект.Ставка);
	//Запрос.УстановитьПараметр("ОКАТО_КПП", Объект.ОКАТО_КПП);
	//Запрос.УстановитьПараметр("НеОтбирать", Не ЗначениеЗаполнено(ФизическиеЛица));
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	//Запрос.УстановитьПараметр("УчитыватьДвиженияРегистратора", Объект.Проведен И Объект.Модифицированность() И ДатаОперации > ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Ссылка,"ДатаПлатежа"));
	Результат = Запрос.Выполнить().Выгрузить();
	//КоэффициентыРаспределения = ПроведениеРасчетов.ВыделитьКоэффициентыРаспределенияИзКоллекцииСтрок(Результат,"Сумма");
	//КоэффициентыРаспределения = ВыделитьКоэффициентыРаспределенияИзКоллекцииСтрок(Результат,"Сумма");
	//РезультатРаспределения = ОбщегоНазначенияЗК.РаспределитьПропорционально(Объект.Сумма, КоэффициентыРаспределения, 0);
	//РезультатРаспределения = РаспределитьПропорционально(Объект.Сумма, КоэффициентыРаспределения, 0);
	//
	//Сообщить(Запрос.Текст);
	//Для Каждого ТекущаяСтрока Из Результат Цикл 
	//	Сообщить(""+ТекущаяСтрока.ФизЛицо+" "+ТекущаяСтрока.Сумма);	
	//КонецЦикла; 
	РезультатРаспределения = РаспределитьОстатками(Объект.Сумма, Результат);
	Если РезультатРаспределения = Неопределено Тогда

		Возврат 
	Иначе
		Если ЗначениеЗаполнено(ФизическиеЛица) Тогда
			Для каждого СтрокаТЧ Из Объект.СотрудникиОрганизации Цикл
				СтрокаТЧ.Сумма = 0
			КонецЦикла;
			Индекс = 0;
			Для каждого СтрокаТЗ Из Результат Цикл
				НоваяСтрока = Объект.СотрудникиОрганизации.Найти(СтрокаТЗ.ФизЛицо,"ФизЛицо");
				Если НоваяСтрока <> Неопределено Тогда
					НоваяСтрока.Сумма = РезультатРаспределения[Индекс];
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
		Иначе
			Индекс = 0;
			Для каждого СтрокаТЗ Из Результат Цикл
				Если РезультатРаспределения[Индекс]>0 Тогда
				НоваяСтрока = Объект.СотрудникиОрганизации.Добавить();
				НоваяСтрока.ФизЛицо = СтрокаТЗ.ФизЛицо;
				НоваяСтрока.Сумма = РезультатРаспределения[Индекс];
				Индекс = Индекс + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
	
	
	Если Объект.СотрудникиОрганизации.Количество() = 0 Тогда
		Сообщить("Не обнаружены данные для записи в документ.", СтатусСообщения.Важное )
	//Иначе
		//ЭлементыФормы.СотрудникиОрганизации.ТекущаяСтрока = Объект.СотрудникиОрганизации[0]
		//Объект.СотрудникиОрганизации.ТекущаяСтрока = Объект.СотрудникиОрганизации[0]
	КонецЕсли;

 КонецПроцедуры
 
